# https://cutekaomoji.com/misc/table-flipping/

TABLE_FLIPS=(
	'(╯°□°）╯︵ ┻━┻'
	'(╯'□')╯︵ ┻━┻'
	'(┛◉Д◉)┛彡┻━┻'
	'(ﾉ≧∇≦)ﾉ ﾐ ┸━┸'
	'(ノಠ益ಠ)ノ彡┻━┻'
	'(╯ರ ~ ರ）╯︵ ┻━┻'
	'(┛ಸ_ಸ)┛彡┻━┻'
	'(ﾉ´･ω･)ﾉ ﾐ ┸━┸'
	'(ノಥ,_｣ಥ)ノ彡┻━┻'
	'(┛✧Д✧))┛彡┻━┻'
	'┻━┻ ︵ヽ(`Д´)ﾉ︵ ┻━┻'
	'┻━┻ ︵ ¯\(ツ)/¯ ︵ ┻━┻'
	'(ノTДT)ノ ┫:･’.::･┻┻:･’.::･'
	'(ノ｀⌒´)ノ ┫：・’.：：・┻┻：・’.：：・'
	'(ﾉ*｀▽´*)ﾉ ⌒┫ ┻ ┣ ┳'
	'┻━┻ミ＼(≧ﾛ≦＼)'
	'┻━┻︵└(՞▃՞ └)'
	'┻━┻︵└(´▃｀└)'
	'─=≡Σ((((╯°□°）╯︵ ┻━┻'
	'(ノ｀´)ノ ~┻━┻'
	'(-_- )ﾉ⌒┫ ┻ ┣'
	'(ノ￣皿￣）ノ ⌒=== ┫'
	'ノ｀⌒´)ノ ┫：・’.：：・┻┻'
	'༼ﾉຈل͜ຈ༽ﾉ︵┻━┻'
	'ヽ༼ຈل͜ຈ༽ﾉ⌒┫ ┻ ┣'
	'ﾐ┻┻(ﾉ>｡<)ﾉ'
	'.::･┻┻☆()ﾟOﾟ)'
	'(ノʘ言ʘ)ﾉ ⌒┫ ┻ ┣ ┳☆(>｡☆)'
	'(ノ｀m´)ノ ~┻━┻ (/o＼)'
	'(ﾉ≧∇≦)ﾉ ﾐ ┸┸)`νﾟ)･;’.'
	'ミ(ノ￣^￣)ノ≡≡≡≡≡━┳━☆()￣□￣)/'
)

TABLE_SETS=(
	'┣ﾍ(^▽^ﾍ)Ξ(ﾟ▽ﾟ*)ﾉ┳━┳'
	'┬──┬ ノ( ゜-゜ノ)'
	'┬──┬ ¯\_(ツ)'
	'(ヘ･_･)ヘ┳━┳'
	'ヘ(´° □°)ヘ┳━┳'
	'┣ﾍ(≧∇≦ﾍ)… (≧∇≦)/┳━┳'
	'(つ ์ 𓎟 ์ )つ┳━┳'
	'(੭່˙ ์•͈ ▿ •͈ ์ )੭່˙┬──┬'
)

alias table-flip-random='shuf -e "${TABLE_FLIPS[@]}" | head -n 1'
alias table-set-random='shuf -e "${TABLE_SETS[@]}" | head -n 1'

alias table-flip='table-flip-random'
alias table-set='table-set-random'

alias flip-table="echo '(╯°□°)╯︵ ┻━┻'"
alias look-of-disapproval="echo 'ಠ_ಠ'"
alias middle-finger="echo 't(-.-t)'"
alias shrug="echo '¯\_(ツ)_/¯'"
alias y-u-no="echo 'ლ(ಠ益ಠლ)'"
